app/controllers/list_items_controller.rb

  def index
      @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)

  def show
      @todo_list = TodoList.find(params[:todo_list_id])
      @list_item = @todo_list.list_items.find(params[:id])
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)
SELECT * FROM "list_items" WHERE ("list_items"."id" = 1 AND ("list_items".todo_list_id = 1))

  def new
      @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)

  def create
      @todo_list = TodoList.find(params[:todo_list_id])
      @list_item = @todo_list.list_items.build(params[:list_item])
      if @list_item.save
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)
INSERT INTO "list_items" ("updated_at", "todo_list_id", "title", "description", "created_at") VALUES('2012-10-03 19:35:18', 3, 'Item1.1', 'Item1.1 a ser feito', '2012-10-03 19:35:18')

  def edit
      @todo_list = TodoList.find(params[:todo_list_id])
      @list_item = @todo_list.list_items.find(params[:id])
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)
SELECT * FROM "list_items" WHERE ("list_items"."id" = 1 AND ("list_items".todo_list_id = 1))