app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.all
---
SELECT * FROM "todo_lists"

  def show
    @todo_list = TodoList.find(params[:id])
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)

  def edit
    @todo_list = TodoList.find(params[:id])
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)

  def create
    @todo_list = TodoList.new(params[:todo_list])

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("updated_at", "title", "created_at") VALUES('2012-10-03 19:34:09', 'Lista1', '2012-10-03 19:34:09')

  def destroy
    @todo_list = TodoList.find(params[:id])
    @todo_list.destroy
---
SELECT * FROM "todo_lists" WHERE ("todo_lists"."id" = 1)
DELETE FROM "todo_lists" WHERE "id" = 1